system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volVectorFieldValue U (0 0 0) volScalarFieldValue T 300 volScalarFieldValue p 1 );

regions         ( boxToCell { box (-10 -0.1 -0.1) (0 0.1 0.1) ; fieldValues ( volScalarFieldValue T 500 volScalarFieldValue p 15000000 ) ; } );


// ************************************************************************* //
